# Великий Кодекс Техномагии
# Имя нашего священного документа, в котором хранятся все наши знания и ритуалы.
# Свиток 26: Пергамент с заклинанием для "Ока Истины"
# Название текущего раздела Кодекса. Имя "Око Истины" намекает, что этот свиток будет посвящен проверке и испытанию нашей магии.


# Мы начинаем определение нашего "заклинания", которому даем имя `add_two_runes` и указываем, что оно принимает два "компонента" (`a` и `b`).
def add_two_runes(a, b):
    # Это "официальное описание" заклинания (docstring). Оно заносится в гримуар и объясняет другим магам, в чем заключается его суть.
    """Это простое заклинание складывает силу двух рун."""
    # Главное магическое действие: заклинание `return` "материализует" результат, который равен сумме сил двух рун (`a + b`).
    return a + b


# trigger 1
